Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2064das176.h
extern volatile __SBT0ECONbits_t SBT0ECONbits __asm__ ("SBT0ECON") __attribute__((section("sfrs"), address(0xBF8F8028)));
#define SBT0ECLRS SBT0ECLRS
extern volatile uint32_t   SBT0ECLRS __attribute__((section("sfrs"), address(0xBF8F8030)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT0ECLRSbits_t;
extern volatile __SBT0ECLRSbits_t SBT0ECLRSbits __asm__ ("SBT0ECLRS") __attribute__((section("sfrs"), address(0xBF8F8030)));
#define SBT0ECLRM SBT0ECLRM
extern volatile uint32_t   SBT0ECLRM __attribute__((section("sfrs"), address(0xBF8F8038)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT0ECLRMbits_t;
extern volatile __SBT0ECLRMbits_t SBT0ECLRMbits __asm__ ("SBT0ECLRM") __attribute__((section("sfrs"), address(0xBF8F8038)));
#define SBT0REG0 SBT0REG0
extern volatile uint32_t   SBT0REG0 __attribute__((section("sfrs"), address(0xBF8F8040)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT0REG0bits_t;
extern volatile __SBT0REG0bits_t SBT0REG0bits __asm__ ("SBT0REG0") __attribute__((section("sfrs"), address(0xBF8F8040)));
#define SBT0RD0 SBT0RD0
extern volatile uint32_t   SBT0RD0 __attribute__((section("sfrs"), address(0xBF8F8050)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT0RD0bits_t;
extern volatile __SBT0RD0bits_t SBT0RD0bits __asm__ ("SBT0RD0") __attribute__((section("sfrs"), address(0xBF8F8050)));
#define SBT0WR0 SBT0WR0
extern volatile uint32_t   SBT0WR0 __attribute__((section("sfrs"), address(0xBF8F8058)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT0WR0bits_t;
extern volatile __SBT0WR0bits_t SBT0WR0bits __asm__ ("SBT0WR0") __attribute__((section("sfrs"), address(0xBF8F8058)));
#define SBT0REG1 SBT0REG1
extern volatile uint32_t   SBT0REG1 __attribute__((section("sfrs"), address(0xBF8F8060)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT0REG1bits_t;
extern volatile __SBT0REG1bits_t SBT0REG1bits __asm__ ("SBT0REG1") __attribute__((section("sfrs"), address(0xBF8F8060)));
#define SBT0RD1 SBT0RD1
extern volatile uint32_t   SBT0RD1 __attribute__((section("sfrs"), address(0xBF8F8070)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT0RD1bits_t;
extern volatile __SBT0RD1bits_t SBT0RD1bits __asm__ ("SBT0RD1") __attribute__((section("sfrs"), address(0xBF8F8070)));
#define SBT0WR1 SBT0WR1
extern volatile uint32_t   SBT0WR1 __attribute__((section("sfrs"), address(0xBF8F8078)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT0WR1bits_t;
extern volatile __SBT0WR1bits_t SBT0WR1bits __asm__ ("SBT0WR1") __attribute__((section("sfrs"), address(0xBF8F8078)));
#define SBT1ELOG1 SBT1ELOG1
extern volatile uint32_t   SBT1ELOG1 __attribute__((section("sfrs"), address(0xBF8F8420)));
typedef struct {
  uint32_t CMD:3;
  uint32_t :1;
  uint32_t REGION:4;
  uint32_t INITID:8;
  uint32_t :8;
  uint32_t CODE:4;
  uint32_t :3;
  uint32_t MULTI:1;
} __SBT1ELOG1bits_t;
extern volatile __SBT1ELOG1bits_t SBT1ELOG1bits __asm__ ("SBT1ELOG1") __attribute__((section("sfrs"), address(0xBF8F8420)));
#define SBT1ELOG2 SBT1ELOG2
extern volatile uint32_t   SBT1ELOG2 __attribute__((section("sfrs"), address(0xBF8F8424)));
typedef struct {
  uint32_t GROUP:2;
} __SBT1ELOG2bits_t;
extern volatile __SBT1ELOG2bits_t SBT1ELOG2bits __asm__ ("SBT1ELOG2") __attribute__((section("sfrs"), address(0xBF8F8424)));
#define SBT1ECON SBT1ECON
extern volatile uint32_t   SBT1ECON __attribute__((section("sfrs"), address(0xBF8F8428)));
typedef struct {
  uint32_t :24;
  uint32_t ERRP:1;
} __SBT1ECONbits_t;
extern volatile __SBT1ECONbits_t SBT1ECONbits __asm__ ("SBT1ECON") __attribute__((section("sfrs"), address(0xBF8F8428)));
#define SBT1ECLRS SBT1ECLRS
extern volatile uint32_t   SBT1ECLRS __attribute__((section("sfrs"), address(0xBF8F8430)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT1ECLRSbits_t;
extern volatile __SBT1ECLRSbits_t SBT1ECLRSbits __asm__ ("SBT1ECLRS") __attribute__((section("sfrs"), address(0xBF8F8430)));
#define SBT1ECLRM SBT1ECLRM
extern volatile uint32_t   SBT1ECLRM __attribute__((section("sfrs"), address(0xBF8F8438)));
typedef struct {
  uint32_t CLEAR:1;
} __SBT1ECLRMbits_t;
extern volatile __SBT1ECLRMbits_t SBT1ECLRMbits __asm__ ("SBT1ECLRM") __attribute__((section("sfrs"), address(0xBF8F8438)));
#define SBT1REG0 SBT1REG0
extern volatile uint32_t   SBT1REG0 __attribute__((section("sfrs"), address(0xBF8F8440)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG0bits_t;
extern volatile __SBT1REG0bits_t SBT1REG0bits __asm__ ("SBT1REG0") __attribute__((section("sfrs"), address(0xBF8F8440)));
#define SBT1RD0 SBT1RD0
extern volatile uint32_t   SBT1RD0 __attribute__((section("sfrs"), address(0xBF8F8450)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD0bits_t;
extern volatile __SBT1RD0bits_t SBT1RD0bits __asm__ ("SBT1RD0") __attribute__((section("sfrs"), address(0xBF8F8450)));
#define SBT1WR0 SBT1WR0
extern volatile uint32_t   SBT1WR0 __attribute__((section("sfrs"), address(0xBF8F8458)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1WR0bits_t;
extern volatile __SBT1WR0bits_t SBT1WR0bits __asm__ ("SBT1WR0") __attribute__((section("sfrs"), address(0xBF8F8458)));
#define SBT1REG2 SBT1REG2
extern volatile uint32_t   SBT1REG2 __attribute__((section("sfrs"), address(0xBF8F8480)));
typedef struct {
  uint32_t :3;
  uint32_t SIZE:5;
  uint32_t :1;
  uint32_t PRI:1;
  uint32_t BASE:22;
} __SBT1REG2bits_t;
extern volatile __SBT1REG2bits_t SBT1REG2bits __asm__ ("SBT1REG2") __attribute__((section("sfrs"), address(0xBF8F8480)));
#define SBT1RD2 SBT1RD2
extern volatile uint32_t   SBT1RD2 __attribute__((section("sfrs"), address(0xBF8F8490)));
typedef struct {
  uint32_t GROUP0:1;
  uint32_t GROUP1:1;
  uint32_t GROUP2:1;
  uint32_t GROUP3:1;
} __SBT1RD2bits_t;
