Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2064das176.h
  .extern GLCDCURDATA101   /* 0xBF8EA994 */
  .extern GLCDCURDATA102   /* 0xBF8EA998 */
  .extern GLCDCURDATA103   /* 0xBF8EA99C */
  .extern GLCDCURDATA104   /* 0xBF8EA9A0 */
  .extern GLCDCURDATA105   /* 0xBF8EA9A4 */
  .extern GLCDCURDATA106   /* 0xBF8EA9A8 */
  .extern GLCDCURDATA107   /* 0xBF8EA9AC */
  .extern GLCDCURDATA108   /* 0xBF8EA9B0 */
  .extern GLCDCURDATA109   /* 0xBF8EA9B4 */
  .extern GLCDCURDATA110   /* 0xBF8EA9B8 */
  .extern GLCDCURDATA111   /* 0xBF8EA9BC */
  .extern GLCDCURDATA112   /* 0xBF8EA9C0 */
  .extern GLCDCURDATA113   /* 0xBF8EA9C4 */
  .extern GLCDCURDATA114   /* 0xBF8EA9C8 */
  .extern GLCDCURDATA115   /* 0xBF8EA9CC */
  .extern GLCDCURDATA116   /* 0xBF8EA9D0 */
  .extern GLCDCURDATA117   /* 0xBF8EA9D4 */
  .extern GLCDCURDATA118   /* 0xBF8EA9D8 */
  .extern GLCDCURDATA119   /* 0xBF8EA9DC */
  .extern GLCDCURDATA120   /* 0xBF8EA9E0 */
  .extern GLCDCURDATA121   /* 0xBF8EA9E4 */
  .extern GLCDCURDATA122   /* 0xBF8EA9E8 */
  .extern GLCDCURDATA123   /* 0xBF8EA9EC */
  .extern GLCDCURDATA124   /* 0xBF8EA9F0 */
  .extern GLCDCURDATA125   /* 0xBF8EA9F4 */
  .extern GLCDCURDATA126   /* 0xBF8EA9F8 */
  .extern GLCDCURDATA127   /* 0xBF8EA9FC */
  .extern GLCDCURLUT0      /* 0xBF8EAA00 */
  .extern GLCDCURLUT1      /* 0xBF8EAA04 */
  .extern GLCDCURLUT2      /* 0xBF8EAA08 */
  .extern GLCDCURLUT3      /* 0xBF8EAA0C */
  .extern GLCDCURLUT4      /* 0xBF8EAA10 */
  .extern GLCDCURLUT5      /* 0xBF8EAA14 */
  .extern GLCDCURLUT6      /* 0xBF8EAA18 */
  .extern GLCDCURLUT7      /* 0xBF8EAA1C */
  .extern GLCDCURLUT8      /* 0xBF8EAA20 */
  .extern GLCDCURLUT9      /* 0xBF8EAA24 */
  .extern GLCDCURLUT10     /* 0xBF8EAA28 */
  .extern GLCDCURLUT11     /* 0xBF8EAA2C */
  .extern GLCDCURLUT12     /* 0xBF8EAA30 */
  .extern GLCDCURLUT13     /* 0xBF8EAA34 */
  .extern GLCDCURLUT14     /* 0xBF8EAA38 */
  .extern GLCDCURLUT15     /* 0xBF8EAA3C */
  .extern GPUBASEADDR      /* 0xBF8EB000 */
  .extern SDHCBLKCON       /* 0xBF8EC004 */
  .extern SDHCARG          /* 0xBF8EC008 */
  .extern SDHCMODE         /* 0xBF8EC00C */
  .extern SDHCRESP0        /* 0xBF8EC010 */
  .extern SDHCRESP1        /* 0xBF8EC014 */
  .extern SDHCRESP2        /* 0xBF8EC018 */
  .extern SDHCRESP3        /* 0xBF8EC01C */
  .extern SDHCDATA         /* 0xBF8EC020 */
  .extern SDHCSTAT1        /* 0xBF8EC024 */
  .extern SDHCCON1         /* 0xBF8EC028 */
  .extern SDHCCON2         /* 0xBF8EC02C */
  .extern SDHCINTSTAT      /* 0xBF8EC030 */
  .extern SDHCINTEN        /* 0xBF8EC034 */
  .extern SDHCINTSEN       /* 0xBF8EC038 */
  .extern SDHCSTAT2        /* 0xBF8EC03C */
  .extern SDHCCAP          /* 0xBF8EC040 */
  .extern SDHCMAXCAP       /* 0xBF8EC048 */
  .extern SDHCFE           /* 0xBF8EC050 */
  .extern SDHCAESTAT       /* 0xBF8EC054 */
  .extern SDHCAADDR        /* 0xBF8EC058 */
  .extern SBFLAG0          /* 0xBF8F0510 */
  .extern SBT0ELOG1        /* 0xBF8F8020 */
  .extern SBT0ELOG2        /* 0xBF8F8024 */
  .extern SBT0ECON         /* 0xBF8F8028 */
  .extern SBT0ECLRS        /* 0xBF8F8030 */
  .extern SBT0ECLRM        /* 0xBF8F8038 */
  .extern SBT0REG0         /* 0xBF8F8040 */
  .extern SBT0RD0          /* 0xBF8F8050 */
  .extern SBT0WR0          /* 0xBF8F8058 */
  .extern SBT0REG1         /* 0xBF8F8060 */
  .extern SBT0RD1          /* 0xBF8F8070 */
  .extern SBT0WR1          /* 0xBF8F8078 */
  .extern SBT1ELOG1        /* 0xBF8F8420 */
  .extern SBT1ELOG2        /* 0xBF8F8424 */
  .extern SBT1ECON         /* 0xBF8F8428 */
  .extern SBT1ECLRS        /* 0xBF8F8430 */
  .extern SBT1ECLRM        /* 0xBF8F8438 */
  .extern SBT1REG0         /* 0xBF8F8440 */
  .extern SBT1RD0          /* 0xBF8F8450 */
  .extern SBT1WR0          /* 0xBF8F8458 */
  .extern SBT1REG2         /* 0xBF8F8480 */
  .extern SBT1RD2          /* 0xBF8F8490 */
  .extern SBT1WR2          /* 0xBF8F8498 */
  .extern SBT1REG3         /* 0xBF8F84A0 */
  .extern SBT1RD3          /* 0xBF8F84B0 */
  .extern SBT1WR3          /* 0xBF8F84B8 */
  .extern SBT1REG4         /* 0xBF8F84C0 */
  .extern SBT1RD4          /* 0xBF8F84D0 */
  .extern SBT1WR4          /* 0xBF8F84D8 */
  .extern SBT1REG5         /* 0xBF8F84E0 */
  .extern SBT1RD5          /* 0xBF8F84F0 */
  .extern SBT1WR5          /* 0xBF8F84F8 */
  .extern SBT1REG6         /* 0xBF8F8500 */
  .extern SBT1RD6          /* 0xBF8F8510 */
  .extern SBT1WR6          /* 0xBF8F8518 */
  .extern SBT1REG7         /* 0xBF8F8520 */
  .extern SBT1RD7          /* 0xBF8F8530 */
  .extern SBT1WR7          /* 0xBF8F8538 */
  .extern SBT1REG8         /* 0xBF8F8540 */
  .extern SBT1RD8          /* 0xBF8F8550 */
  .extern SBT1WR8          /* 0xBF8F8558 */
  .extern SBT2ELOG1        /* 0xBF8F8820 */
  .extern SBT2ELOG2        /* 0xBF8F8824 */
  .extern SBT2ECON         /* 0xBF8F8828 */
  .extern SBT2ECLRS        /* 0xBF8F8830 */
  .extern SBT2ECLRM        /* 0xBF8F8838 */
  .extern SBT2REG0         /* 0xBF8F8840 */
  .extern SBT2RD0          /* 0xBF8F8850 */
  .extern SBT2WR0          /* 0xBF8F8858 */
  .extern SBT2REG1         /* 0xBF8F8860 */
  .extern SBT2RD1          /* 0xBF8F8870 */
  .extern SBT2WR1          /* 0xBF8F8878 */
  .extern SBT2REG2         /* 0xBF8F8880 */
  .extern SBT2RD2          /* 0xBF8F8890 */
  .extern SBT2WR2          /* 0xBF8F8898 */
  .extern SBT3ELOG1        /* 0xBF8F8C20 */
  .extern SBT3ELOG2        /* 0xBF8F8C24 */
  .extern SBT3ECON         /* 0xBF8F8C28 */
  .extern SBT3ECLRS        /* 0xBF8F8C30 */
  .extern SBT3ECLRM        /* 0xBF8F8C38 */
  .extern SBT3REG0         /* 0xBF8F8C40 */
  .extern SBT3RD0          /* 0xBF8F8C50 */
  .extern SBT3WR0          /* 0xBF8F8C58 */
  .extern SBT3REG1         /* 0xBF8F8C60 */
  .extern SBT3RD1          /* 0xBF8F8C70 */
  .extern SBT3WR1          /* 0xBF8F8C78 */
  .extern SBT3REG2         /* 0xBF8F8C80 */
  .extern SBT3RD2          /* 0xBF8F8C90 */
  .extern SBT3WR2          /* 0xBF8F8C98 */
  .extern SBT4ELOG1        /* 0xBF8F9020 */
  .extern SBT4ELOG2        /* 0xBF8F9024 */
  .extern SBT4ECON         /* 0xBF8F9028 */
  .extern SBT4ECLRS        /* 0xBF8F9030 */
  .extern SBT4ECLRM        /* 0xBF8F9038 */
  .extern SBT4REG0         /* 0xBF8F9040 */
  .extern SBT4RD0          /* 0xBF8F9050 */
  .extern SBT4WR0          /* 0xBF8F9058 */
  .extern SBT4REG1         /* 0xBF8F9060 */
  .extern SBT4RD1          /* 0xBF8F9070 */
  .extern SBT4WR1          /* 0xBF8F9078 */
  .extern SBT4REG2         /* 0xBF8F9080 */
  .extern SBT4RD2          /* 0xBF8F9090 */
  .extern SBT4WR2          /* 0xBF8F9098 */
  .extern SBT4REG3         /* 0xBF8F90A0 */
  .extern SBT4RD3          /* 0xBF8F90B0 */
  .extern SBT4WR3          /* 0xBF8F90B8 */
  .extern SBT4REG4         /* 0xBF8F90C0 */
  .extern SBT4RD4          /* 0xBF8F90D0 */
  .extern SBT4WR4          /* 0xBF8F90D8 */
  .extern SBT5ELOG1        /* 0xBF8F9420 */
  .extern SBT5ELOG2        /* 0xBF8F9424 */
  .extern SBT5ECON         /* 0xBF8F9428 */
  .extern SBT5ECLRS        /* 0xBF8F9430 */
  .extern SBT5ECLRM        /* 0xBF8F9438 */
  .extern SBT5REG0         /* 0xBF8F9440 */
  .extern SBT5RD0          /* 0xBF8F9450 */
  .extern SBT5WR0          /* 0xBF8F9458 */
  .extern SBT5REG1         /* 0xBF8F9460 */
  .extern SBT5RD1          /* 0xBF8F9470 */
  .extern SBT5WR1          /* 0xBF8F9478 */
  .extern SBT5REG2         /* 0xBF8F9480 */
  .extern SBT5RD2          /* 0xBF8F9490 */
  .extern SBT5WR2          /* 0xBF8F9498 */
  .extern SBT5REG3         /* 0xBF8F94A0 */
  .extern SBT5RD3          /* 0xBF8F94B0 */
  .extern SBT5WR3          /* 0xBF8F94B8 */
  .extern SBT5REG4         /* 0xBF8F94C0 */
  .extern SBT5RD4          /* 0xBF8F94D0 */
  .extern SBT5WR4          /* 0xBF8F94D8 */
  .extern SBT6ELOG1        /* 0xBF8F9820 */
  .extern SBT6ELOG2        /* 0xBF8F9824 */
  .extern SBT6ECON         /* 0xBF8F9828 */
  .extern SBT6ECLRS        /* 0xBF8F9830 */
  .extern SBT6ECLRM        /* 0xBF8F9838 */
  .extern SBT6REG0         /* 0xBF8F9840 */
  .extern SBT6RD0          /* 0xBF8F9850 */
  .extern SBT6WR0          /* 0xBF8F9858 */
  .extern SBT6REG1         /* 0xBF8F9860 */
  .extern SBT6RD1          /* 0xBF8F9870 */
  .extern SBT6WR1          /* 0xBF8F9878 */
  .extern SBFLAG1          /* 0xBF900510 */
  .extern SBT7ELOG1        /* 0xBF908420 */
  .extern SBT7ELOG2        /* 0xBF908424 */
  .extern SBT7ECON         /* 0xBF908428 */
  .extern SBT7ECLRS        /* 0xBF908430 */
  .extern SBT7ECLRM        /* 0xBF908438 */
  .extern SBT7REG0         /* 0xBF908440 */
  .extern SBT7RD0          /* 0xBF908450 */
  .extern SBT7WR0          /* 0xBF908458 */
  .extern SBT7REG1         /* 0xBF908460 */
  .extern SBT7RD1          /* 0xBF908470 */
  .extern SBT7WR1          /* 0xBF908478 */
  .extern SBT7REG2         /* 0xBF908480 */
  .extern SBT7RD2          /* 0xBF908490 */
  .extern SBT7WR2          /* 0xBF908498 */
  .extern SBT8ELOG1        /* 0xBF908820 */
  .extern SBT8ELOG2        /* 0xBF908824 */
  .extern SBT8ECON         /* 0xBF908828 */
  .extern SBT8ECLRS        /* 0xBF908830 */
  .extern SBT8ECLRM        /* 0xBF908838 */
  .extern SBT8REG0         /* 0xBF908840 */
  .extern SBT8RD0          /* 0xBF908850 */
  .extern SBT8WR0          /* 0xBF908858 */
  .extern SBT8REG1         /* 0xBF908880 */
  .extern SBT8RD1          /* 0xBF908890 */
  .extern SBT8WR1          /* 0xBF908898 */
  .extern SBT9ELOG1        /* 0xBF908C20 */
  .extern SBT9ELOG2        /* 0xBF908C24 */
  .extern SBT9ECON         /* 0xBF908C28 */
  .extern SBT9ECLRS        /* 0xBF908C30 */
  .extern SBT9ECLRM        /* 0xBF908C38 */
  .extern SBT9REG0         /* 0xBF908C40 */
  .extern SBT9RD0          /* 0xBF908C50 */
  .extern SBT9WR0          /* 0xBF908C58 */
  .extern SBT9REG1         /* 0xBF908C60 */
  .extern SBT9RD1          /* 0xBF908C70 */
  .extern SBT9WR1          /* 0xBF908C78 */
  .extern SBT10ELOG1       /* 0xBF909020 */
  .extern SBT10ELOG2       /* 0xBF909024 */
  .extern SBT10ECON        /* 0xBF909028 */
  .extern SBT10ECLRS       /* 0xBF909030 */
  .extern SBT10ECLRM       /* 0xBF909038 */
  .extern SBT10REG0        /* 0xBF909040 */
  .extern SBT10RD0         /* 0xBF909050 */
  .extern SBT10WR0         /* 0xBF909058 */
  .extern SBT10REG1        /* 0xBF909060 */
  .extern SBT10RD1         /* 0xBF909070 */
  .extern SBT10WR1         /* 0xBF909078 */
  .extern SBT11ELOG1       /* 0xBF909420 */
  .extern SBT11ELOG2       /* 0xBF909424 */
  .extern SBT11ECON        /* 0xBF909428 */
  .extern SBT11ECLRS       /* 0xBF909430 */
  .extern SBT11ECLRM       /* 0xBF909438 */
  .extern SBT11REG0        /* 0xBF909440 */
  .extern SBT11RD0         /* 0xBF909450 */
  .extern SBT11WR0         /* 0xBF909458 */
  .extern SBT11REG1        /* 0xBF909460 */
  .extern SBT11RD1         /* 0xBF909470 */
  .extern SBT11WR1         /* 0xBF909478 */
  .extern SBT12ELOG1       /* 0xBF909820 */
  .extern SBT12ELOG2       /* 0xBF909824 */
  .extern SBT12ECON        /* 0xBF909828 */
  .extern SBT12ECLRS       /* 0xBF909830 */
  .extern SBT12ECLRM       /* 0xBF909838 */
  .extern SBT12REG0        /* 0xBF909840 */
  .extern SBT12RD0         /* 0xBF909850 */
  .extern SBT12WR0         /* 0xBF909858 */
  .extern SBFLAG2          /* 0xBF910510 */
  .extern SBT13ELOG1       /* 0xBF918420 */
  .extern SBT13ELOG2       /* 0xBF918424 */
  .extern SBT13ECON        /* 0xBF918428 */
  .extern SBT13ECLRS       /* 0xBF918430 */
  .extern SBT13ECLRM       /* 0xBF918438 */
  .extern SBT13REG0        /* 0xBF918440 */
  .extern SBT13RD0         /* 0xBF918450 */
  .extern SBT13WR0         /* 0xBF918458 */
  .extern SBT13REG1        /* 0xBF918460 */
  .extern SBT13RD1         /* 0xBF918470 */
  .extern SBT13WR1         /* 0xBF918478 */
  .extern SBT14ELOG1       /* 0xBF918820 */
  .extern SBT14ELOG2       /* 0xBF918824 */
  .extern SBT14ECON        /* 0xBF918828 */
  .extern SBT14ECLRS       /* 0xBF918830 */
  .extern SBT14ECLRM       /* 0xBF918838 */
  .extern SBT14REG0        /* 0xBF918840 */
  .extern SBT14RD0         /* 0xBF918850 */
  .extern SBT14WR0         /* 0xBF918858 */
  .extern SBT14REG1        /* 0xBF918860 */
  .extern SBT14RD1         /* 0xBF918870 */
  .extern SBT14WR1         /* 0xBF918878 */
  .extern SBT15ELOG1       /* 0xBF918C20 */
  .extern SBT15ELOG2       /* 0xBF918C24 */
  .extern SBT15ECON        /* 0xBF918C28 */
  .extern SBT15ECLRS       /* 0xBF918C30 */
  .extern SBT15ECLRM       /* 0xBF918C38 */
  .extern SBT15REG0        /* 0xBF918C40 */
  .extern SBT15RD0         /* 0xBF918C50 */
  .extern SBT15WR0         /* 0xBF918C58 */
  .extern SBFLAG3          /* 0xBF920510 */
  .extern SBT16ELOG1       /* 0xBF92C420 */
  .extern SBT16ELOG2       /* 0xBF92C424 */
  .extern SBT16ECON        /* 0xBF92C428 */
  .extern SBT16ECLRS       /* 0xBF92C430 */
  .extern SBT16ECLRM       /* 0xBF92C438 */
  .extern SBT16REG0        /* 0xBF92C440 */
  .extern SBT16RD0         /* 0xBF92C450 */
  .extern SBT16WR0         /* 0xBF92C458 */
  .extern SBT16REG1        /* 0xBF92C460 */
  .extern SBT16RD1         /* 0xBF92C470 */
  .extern SBT16WR1         /* 0xBF92C478 */
  .extern SBT16REG2        /* 0xBF92C480 */
  .extern SBT16RD2         /* 0xBF92C490 */
  .extern SBT16WR2         /* 0xBF92C498 */
  .extern SBT16REG3        /* 0xBF92C4A0 */
  .extern SBT16RD3         /* 0xBF92C4B0 */
  .extern SBT16WR3         /* 0xBF92C4B8 */
  .extern SBT16REG4        /* 0xBF92C4C0 */
  .extern SBT16RD4         /* 0xBF92C4D0 */
  .extern SBT16WR4         /* 0xBF92C4D8 */
  .extern USBIE0CSR0       /* 0xBF8E3010 */
  .extern USBIENCSR0       /* 0xBF8E3010 */
  .extern USBIE0CSR2       /* 0xBF8E3018 */
  .extern USBIENCSR2       /* 0xBF8E3018 */
  .extern USBIE0CSR3       /* 0xBF8E301C */
  .extern USBIENCSR3       /* 0xBF8E301C */
  .extern DEVCFG4          /* 0xBFC0FFBC */
  .extern DEVCFG3          /* 0xBFC0FFC0 */
  .extern DEVCFG2          /* 0xBFC0FFC4 */
  .extern DEVCFG1          /* 0xBFC0FFC8 */
  .extern DEVCFG0          /* 0xBFC0FFCC */
  .extern DEVCP3           /* 0xBFC0FFD0 */
  .extern DEVCP2           /* 0xBFC0FFD4 */
  .extern DEVCP1           /* 0xBFC0FFD8 */
  .extern DEVCP0           /* 0xBFC0FFDC */
  .extern DEVSIGN3         /* 0xBFC0FFE0 */
  .extern DEVSIGN2         /* 0xBFC0FFE4 */
  .extern DEVSIGN1         /* 0xBFC0FFE8 */
  .extern DEVSIGN0         /* 0xBFC0FFEC */
  .extern SEQ3             /* 0xBFC0FFF0 */
  .extern SEQ2             /* 0xBFC0FFF4 */
  .extern SEQ1             /* 0xBFC0FFF8 */
  .extern SEQ0             /* 0xBFC0FFFC */
  .extern DEVADC0          /* 0xBFC54000 */
  .extern DEVADC1          /* 0xBFC54004 */
  .extern DEVADC2          /* 0xBFC54008 */
  .extern DEVADC3          /* 0xBFC5400C */
  .extern DEVADC4          /* 0xBFC54010 */
  .extern DEVADC7          /* 0xBFC5401C */
  .extern DEVSN0           /* 0xBFC54020 */
  .extern DEVSN1           /* 0xBFC54024 */
  .extern DEVSN2           /* 0xBFC54028 */
  .extern DEVSN3           /* 0xBFC5402C */
  .extern ADEVCFG4         /* 0xBFC0FF3C */
  .extern ADEVCFG3         /* 0xBFC0FF40 */
  .extern ADEVCFG2         /* 0xBFC0FF44 */
  .extern ADEVCFG1         /* 0xBFC0FF48 */
  .extern ADEVCFG0         /* 0xBFC0FF4C */
  .extern ADEVCP3          /* 0xBFC0FF50 */
  .extern ADEVCP2          /* 0xBFC0FF54 */
  .extern ADEVCP1          /* 0xBFC0FF58 */
  .extern ADEVCP0          /* 0xBFC0FF5C */
  .extern ADEVSIGN3        /* 0xBFC0FF60 */
  .extern ADEVSIGN2        /* 0xBFC0FF64 */
  .extern ADEVSIGN1        /* 0xBFC0FF68 */
  .extern ADEVSIGN0        /* 0xBFC0FF6C */
  .extern ASEQ3            /* 0xBFC0FF70 */
  .extern ASEQ2            /* 0xBFC0FF74 */
  .extern ASEQ1            /* 0xBFC0FF78 */
  .extern ASEQ0            /* 0xBFC0FF7C */
  .extern AUBADEVCFG4      /* 0xBFC2FF3C */
  .extern AUBADEVCFG3      /* 0xBFC2FF40 */
  .extern AUBADEVCFG2      /* 0xBFC2FF44 */
  .extern AUBADEVCFG1      /* 0xBFC2FF48 */
  .extern AUBADEVCFG0      /* 0xBFC2FF4C */
  .extern AUBADEVCP3       /* 0xBFC2FF50 */
  .extern AUBADEVCP2       /* 0xBFC2FF54 */
  .extern AUBADEVCP1       /* 0xBFC2FF58 */
  .extern AUBADEVCP0       /* 0xBFC2FF5C */
  .extern AUBADEVSIGN3     /* 0xBFC2FF60 */
  .extern AUBADEVSIGN2     /* 0xBFC2FF64 */
  .extern AUBADEVSIGN1     /* 0xBFC2FF68 */
  .extern AUBADEVSIGN0     /* 0xBFC2FF6C */
  .extern AUBASEQ3         /* 0xBFC2FF70 */
  .extern AUBASEQ2         /* 0xBFC2FF74 */
  .extern AUBASEQ1         /* 0xBFC2FF78 */
  .extern AUBASEQ0         /* 0xBFC2FF7C */
  .extern UBADEVCFG4       /* 0xBFC2FFBC */
  .extern UBADEVCFG3       /* 0xBFC2FFC0 */
  .extern UBADEVCFG2       /* 0xBFC2FFC4 */
  .extern UBADEVCFG1       /* 0xBFC2FFC8 */
  .extern UBADEVCFG0       /* 0xBFC2FFCC */
  .extern UBADEVCP3        /* 0xBFC2FFD0 */
  .extern UBADEVCP2        /* 0xBFC2FFD4 */
  .extern UBADEVCP1        /* 0xBFC2FFD8 */
  .extern UBADEVCP0        /* 0xBFC2FFDC */
  .extern UBADEVSIGN3      /* 0xBFC2FFE0 */
  .extern UBADEVSIGN2      /* 0xBFC2FFE4 */
  .extern UBADEVSIGN1      /* 0xBFC2FFE8 */
  .extern UBADEVSIGN0      /* 0xBFC2FFEC */
  .extern UBASEQ3          /* 0xBFC2FFF0 */
  .extern UBASEQ2          /* 0xBFC2FFF4 */
  .extern UBASEQ1          /* 0xBFC2FFF8 */
  .extern UBASEQ0          /* 0xBFC2FFFC */
  .extern ABF1DEVCFG4      /* 0xBFC4FF3C */
  .extern ABF1DEVCFG3      /* 0xBFC4FF40 */
  .extern ABF1DEVCFG2      /* 0xBFC4FF44 */
  .extern ABF1DEVCFG1      /* 0xBFC4FF48 */
  .extern ABF1DEVCFG0      /* 0xBFC4FF4C */
  .extern ABF1DEVCP3       /* 0xBFC4FF50 */
  .extern ABF1DEVCP2       /* 0xBFC4FF54 */
  .extern ABF1DEVCP1       /* 0xBFC4FF58 */
  .extern ABF1DEVCP0       /* 0xBFC4FF5C */
  .extern ABF1DEVSIGN3     /* 0xBFC4FF60 */
  .extern ABF1DEVSIGN2     /* 0xBFC4FF64 */
  .extern ABF1DEVSIGN1     /* 0xBFC4FF68 */
  .extern ABF1DEVSIGN0     /* 0xBFC4FF6C */
  .extern ABF1SEQ3         /* 0xBFC4FF70 */
  .extern ABF1SEQ2         /* 0xBFC4FF74 */
  .extern ABF1SEQ1         /* 0xBFC4FF78 */
  .extern ABF1SEQ0         /* 0xBFC4FF7C */
  .extern BF1DEVCFG4       /* 0xBFC4FFBC */
  .extern BF1DEVCFG3       /* 0xBFC4FFC0 */
  .extern BF1DEVCFG2       /* 0xBFC4FFC4 */
  .extern BF1DEVCFG1       /* 0xBFC4FFC8 */
  .extern BF1DEVCFG0       /* 0xBFC4FFCC */
  .extern BF1DEVCP3        /* 0xBFC4FFD0 */
  .extern BF1DEVCP2        /* 0xBFC4FFD4 */
  .extern BF1DEVCP1        /* 0xBFC4FFD8 */
  .extern BF1DEVCP0        /* 0xBFC4FFDC */
  .extern BF1DEVSIGN3      /* 0xBFC4FFE0 */
  .extern BF1DEVSIGN2      /* 0xBFC4FFE4 */
  .extern BF1DEVSIGN1      /* 0xBFC4FFE8 */
  .extern BF1DEVSIGN0      /* 0xBFC4FFEC */
  .extern BF1SEQ3          /* 0xBFC4FFF0 */
  .extern BF1SEQ2          /* 0xBFC4FFF4 */
  .extern BF1SEQ1          /* 0xBFC4FFF8 */
  .extern BF1SEQ0          /* 0xBFC4FFFC */
  .extern ABF2DEVCFG4      /* 0xBFC6FF3C */
  .extern ABF2DEVCFG3      /* 0xBFC6FF40 */
  .extern ABF2DEVCFG2      /* 0xBFC6FF44 */
  .extern ABF2DEVCFG1      /* 0xBFC6FF48 */
  .extern ABF2DEVCFG0      /* 0xBFC6FF4C */
  .extern ABF2DEVCP3       /* 0xBFC6FF50 */
  .extern ABF2DEVCP2       /* 0xBFC6FF54 */
  .extern ABF2DEVCP1       /* 0xBFC6FF58 */
  .extern ABF2DEVCP0       /* 0xBFC6FF5C */
  .extern ABF2DEVSIGN3     /* 0xBFC6FF60 */
  .extern ABF2DEVSIGN2     /* 0xBFC6FF64 */
  .extern ABF2DEVSIGN1     /* 0xBFC6FF68 */
  .extern ABF2DEVSIGN0     /* 0xBFC6FF6C */
  .extern ABF2SEQ3         /* 0xBFC6FF70 */
  .extern ABF2SEQ2         /* 0xBFC6FF74 */
  .extern ABF2SEQ1         /* 0xBFC6FF78 */
  .extern ABF2SEQ0         /* 0xBFC6FF7C */
  .extern BF2DEVCFG4       /* 0xBFC6FFBC */
  .extern BF2DEVCFG3       /* 0xBFC6FFC0 */
  .extern BF2DEVCFG2       /* 0xBFC6FFC4 */
  .extern BF2DEVCFG1       /* 0xBFC6FFC8 */
  .extern BF2DEVCFG0       /* 0xBFC6FFCC */
  .extern BF2DEVCP3        /* 0xBFC6FFD0 */
  .extern BF2DEVCP2        /* 0xBFC6FFD4 */
  .extern BF2DEVCP1        /* 0xBFC6FFD8 */
  .extern BF2DEVCP0        /* 0xBFC6FFDC */
  .extern BF2DEVSIGN3      /* 0xBFC6FFE0 */
  .extern BF2DEVSIGN2      /* 0xBFC6FFE4 */
  .extern BF2DEVSIGN1      /* 0xBFC6FFE8 */
  .extern BF2DEVSIGN0      /* 0xBFC6FFEC */
  .extern BF2SEQ3          /* 0xBFC6FFF0 */
  .extern BF2SEQ2          /* 0xBFC6FFF4 */
  .extern BF2SEQ1          /* 0xBFC6FFF8 */
  .extern BF2SEQ0          /* 0xBFC6FFFC */
#else
#error Unknown language!
#endif

#define _CFGCON_TDOEN_POSITION                   0x00000000
#define _CFGCON_TDOEN_MASK                       0x00000001
#define _CFGCON_TDOEN_LENGTH                     0x00000001

#define _CFGCON_TROEN_POSITION                   0x00000002
#define _CFGCON_TROEN_MASK                       0x00000004
#define _CFGCON_TROEN_LENGTH                     0x00000001

#define _CFGCON_JTAGEN_POSITION                  0x00000003
#define _CFGCON_JTAGEN_MASK                      0x00000008
#define _CFGCON_JTAGEN_LENGTH                    0x00000001

#define _CFGCON_ECCCON_POSITION                  0x00000004
#define _CFGCON_ECCCON_MASK                      0x00000030
#define _CFGCON_ECCCON_LENGTH                    0x00000002

#define _CFGCON_IOANCPEN_POSITION                0x00000007
#define _CFGCON_IOANCPEN_MASK                    0x00000080
#define _CFGCON_IOANCPEN_LENGTH                  0x00000001

#define _CFGCON_USBSSEN_POSITION                 0x00000008
#define _CFGCON_USBSSEN_MASK                     0x00000100
#define _CFGCON_USBSSEN_LENGTH                   0x00000001

