Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.65/include/proc/p32mz2064das176.h
#define _DDRCMD13_CSCMD1_POSITION                0x00000001
#define _DDRCMD13_CSCMD1_MASK                    0x000001FE
#define _DDRCMD13_CSCMD1_LENGTH                  0x00000008

#define _DDRCMD13_RASCMD1_POSITION               0x00000009
#define _DDRCMD13_RASCMD1_MASK                   0x00000200
#define _DDRCMD13_RASCMD1_LENGTH                 0x00000001

#define _DDRCMD13_CASCMD1_POSITION               0x0000000A
#define _DDRCMD13_CASCMD1_MASK                   0x00000400
#define _DDRCMD13_CASCMD1_LENGTH                 0x00000001

#define _DDRCMD13_WENCMD1_POSITION               0x0000000B
#define _DDRCMD13_WENCMD1_MASK                   0x00000800
#define _DDRCMD13_WENCMD1_LENGTH                 0x00000001

#define _DDRCMD13_CLKENCMD2_POSITION             0x0000000C
#define _DDRCMD13_CLKENCMD2_MASK                 0x00001000
#define _DDRCMD13_CLKENCMD2_LENGTH               0x00000001

#define _DDRCMD13_CSCMD2_POSITION                0x0000000D
#define _DDRCMD13_CSCMD2_MASK                    0x001FE000
#define _DDRCMD13_CSCMD2_LENGTH                  0x00000008

#define _DDRCMD13_RASCMD2_POSITION               0x00000015
#define _DDRCMD13_RASCMD2_MASK                   0x00200000
#define _DDRCMD13_RASCMD2_LENGTH                 0x00000001

#define _DDRCMD13_CASCMD2_POSITION               0x00000016
#define _DDRCMD13_CASCMD2_MASK                   0x00400000
#define _DDRCMD13_CASCMD2_LENGTH                 0x00000001

#define _DDRCMD13_WENCMD2_POSITION               0x00000017
#define _DDRCMD13_WENCMD2_MASK                   0x00800000
#define _DDRCMD13_WENCMD2_LENGTH                 0x00000001

#define _DDRCMD13_MDALCMD_POSITION               0x00000018
#define _DDRCMD13_MDALCMD_MASK                   0xFF000000
#define _DDRCMD13_MDALCMD_LENGTH                 0x00000008

#define _DDRCMD14_CLKENCMD1_POSITION             0x00000000
#define _DDRCMD14_CLKENCMD1_MASK                 0x00000001
#define _DDRCMD14_CLKENCMD1_LENGTH               0x00000001

#define _DDRCMD14_CSCMD1_POSITION                0x00000001
#define _DDRCMD14_CSCMD1_MASK                    0x000001FE
#define _DDRCMD14_CSCMD1_LENGTH                  0x00000008

#define _DDRCMD14_RASCMD1_POSITION               0x00000009
#define _DDRCMD14_RASCMD1_MASK                   0x00000200
#define _DDRCMD14_RASCMD1_LENGTH                 0x00000001

#define _DDRCMD14_CASCMD1_POSITION               0x0000000A
#define _DDRCMD14_CASCMD1_MASK                   0x00000400
#define _DDRCMD14_CASCMD1_LENGTH                 0x00000001

#define _DDRCMD14_WENCMD1_POSITION               0x0000000B
#define _DDRCMD14_WENCMD1_MASK                   0x00000800
#define _DDRCMD14_WENCMD1_LENGTH                 0x00000001

#define _DDRCMD14_CLKENCMD2_POSITION             0x0000000C
#define _DDRCMD14_CLKENCMD2_MASK                 0x00001000
#define _DDRCMD14_CLKENCMD2_LENGTH               0x00000001

#define _DDRCMD14_CSCMD2_POSITION                0x0000000D
#define _DDRCMD14_CSCMD2_MASK                    0x001FE000
#define _DDRCMD14_CSCMD2_LENGTH                  0x00000008

#define _DDRCMD14_RASCMD2_POSITION               0x00000015
#define _DDRCMD14_RASCMD2_MASK                   0x00200000
#define _DDRCMD14_RASCMD2_LENGTH                 0x00000001

#define _DDRCMD14_CASCMD2_POSITION               0x00000016
#define _DDRCMD14_CASCMD2_MASK                   0x00400000
#define _DDRCMD14_CASCMD2_LENGTH                 0x00000001

#define _DDRCMD14_WENCMD2_POSITION               0x00000017
#define _DDRCMD14_WENCMD2_MASK                   0x00800000
#define _DDRCMD14_WENCMD2_LENGTH                 0x00000001

#define _DDRCMD14_MDALCMD_POSITION               0x00000018
#define _DDRCMD14_MDALCMD_MASK                   0xFF000000
#define _DDRCMD14_MDALCMD_LENGTH                 0x00000008

#define _DDRCMD15_CLKENCMD1_POSITION             0x00000000
#define _DDRCMD15_CLKENCMD1_MASK                 0x00000001
#define _DDRCMD15_CLKENCMD1_LENGTH               0x00000001

#define _DDRCMD15_CSCMD1_POSITION                0x00000001
#define _DDRCMD15_CSCMD1_MASK                    0x000001FE
#define _DDRCMD15_CSCMD1_LENGTH                  0x00000008

#define _DDRCMD15_RASCMD1_POSITION               0x00000009
#define _DDRCMD15_RASCMD1_MASK                   0x00000200
#define _DDRCMD15_RASCMD1_LENGTH                 0x00000001

#define _DDRCMD15_CASCMD1_POSITION               0x0000000A
#define _DDRCMD15_CASCMD1_MASK                   0x00000400
#define _DDRCMD15_CASCMD1_LENGTH                 0x00000001

#define _DDRCMD15_WENCMD1_POSITION               0x0000000B
#define _DDRCMD15_WENCMD1_MASK                   0x00000800
#define _DDRCMD15_WENCMD1_LENGTH                 0x00000001

#define _DDRCMD15_CLKENCMD2_POSITION             0x0000000C
#define _DDRCMD15_CLKENCMD2_MASK                 0x00001000
#define _DDRCMD15_CLKENCMD2_LENGTH               0x00000001

#define _DDRCMD15_CSCMD2_POSITION                0x0000000D
#define _DDRCMD15_CSCMD2_MASK                    0x001FE000
#define _DDRCMD15_CSCMD2_LENGTH                  0x00000008

#define _DDRCMD15_RASCMD2_POSITION               0x00000015
#define _DDRCMD15_RASCMD2_MASK                   0x00200000
#define _DDRCMD15_RASCMD2_LENGTH                 0x00000001

#define _DDRCMD15_CASCMD2_POSITION               0x00000016
#define _DDRCMD15_CASCMD2_MASK                   0x00400000
#define _DDRCMD15_CASCMD2_LENGTH                 0x00000001

#define _DDRCMD15_WENCMD2_POSITION               0x00000017
#define _DDRCMD15_WENCMD2_MASK                   0x00800000
#define _DDRCMD15_WENCMD2_LENGTH                 0x00000001

#define _DDRCMD15_MDALCMD_POSITION               0x00000018
#define _DDRCMD15_MDALCMD_MASK                   0xFF000000
#define _DDRCMD15_MDALCMD_LENGTH                 0x00000008

#define _DDRCMD16_CLKENCMD1_POSITION             0x00000000
#define _DDRCMD16_CLKENCMD1_MASK                 0x00000001
#define _DDRCMD16_CLKENCMD1_LENGTH               0x00000001

#define _DDRCMD16_CSCMD1_POSITION                0x00000001
#define _DDRCMD16_CSCMD1_MASK                    0x000001FE
#define _DDRCMD16_CSCMD1_LENGTH                  0x00000008

#define _DDRCMD16_RASCMD1_POSITION               0x00000009
#define _DDRCMD16_RASCMD1_MASK                   0x00000200
#define _DDRCMD16_RASCMD1_LENGTH                 0x00000001

#define _DDRCMD16_CASCMD1_POSITION               0x0000000A
#define _DDRCMD16_CASCMD1_MASK                   0x00000400
#define _DDRCMD16_CASCMD1_LENGTH                 0x00000001

#define _DDRCMD16_WENCMD1_POSITION               0x0000000B
#define _DDRCMD16_WENCMD1_MASK                   0x00000800
#define _DDRCMD16_WENCMD1_LENGTH                 0x00000001

